[net]
batch=64
subdivisions=2
height=448
width=448
channels=3
momentum=0.9
decay=0.0005

hue = .1
saturation=.75
exposure=.75

learning_rate=0.0005
policy=steps
steps=200,400,600,800,100000,150000
scales=2.5,2,2,2,.1,.1
max_batches = 200000

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[connected]
output= 4655
activation=linear

[detection]
classes=80
coords=4
rescore=1
side=7
num=3
softmax=0
sqrt=1
jitter=.2

object_scale=1
noobject_scale=.5
class_scale=1
coord_scale=5
./run.sh 
OPENCL ACTIVATED
NOTE: This GSX library has the time limitation by reason of an evaluation module.
INFO: complete to make CL properties
layer     filters    size              input                output
    0 conv     16  3 x 3 / 1   416 x 416 x   3   ->   416 x 416 x  16
    1 max          2 x 2 / 2   416 x 416 x  16   ->   208 x 208 x  16
    2 conv     32  3 x 3 / 1   208 x 208 x  16   ->   208 x 208 x  32
    3 max          2 x 2 / 2   208 x 208 x  32   ->   104 x 104 x  32
    4 conv     64  3 x 3 / 1   104 x 104 x  32   ->   104 x 104 x  64
    5 max          2 x 2 / 2   104 x 104 x  64   ->    52 x  52 x  64
    6 conv    128  3 x 3 / 1    52 x  52 x  64   ->    52 x  52 x 128
    7 max          2 x 2 / 2    52 x  52 x 128   ->    26 x  26 x 128
    8 conv    256  3 x 3 / 1    26 x  26 x 128   ->    26 x  26 x 256
    9 max          2 x 2 / 2    26 x  26 x 256   ->    13 x  13 x 256
   10 conv    512  3 x 3 / 1    13 x  13 x 256   ->    13 x  13 x 512
   11 max          2 x 2 / 1    13 x  13 x 512   ->    13 x  13 x 512
   12 conv   1024  3 x 3 / 1    13 x  13 x 512   ->    13 x  13 x1024
   13 conv    512  3 x 3 / 1    13 x  13 x1024   ->    13 x  13 x 512
   14 conv    425  1 x 1 / 1    13 x  13 x 512   ->    13 x  13 x 425
   15 detection
mask_scale: Using default '1.000000'
workspace_size: 24920064
sizeof(float): 4
Loading weights from tiny-yolo.weights...Done!
	layer_0 : <forward_convolutional_layer>
gws : 416 416 16
m : 16, k : 27
copy to device time : 0.002379 sec
execution time : 0.046804 sec
copy from gpu time : 0.032535 sec
conv ocl time : 0.081754 sec
l.workspace_size: 18690048
layer 0: Predicted in 0.081813 seconds.

	layer_1 : <forward_maxpool_layer>
l.workspace_size: 0
layer 1: Predicted in 0.046828 seconds.

	layer_2 : <forward_convolutional_layer>
gws : 208 208 32
m : 32, k : 144
copy to device time : 0.003044 sec
execution time : 0.108897 sec
copy from gpu time : 0.016173 sec
conv ocl time : 0.128144 sec
l.workspace_size: 24920064
layer 2: Predicted in 0.128178 seconds.

	layer_3 : <forward_maxpool_layer>
l.workspace_size: 0
layer 3: Predicted in 0.024200 seconds.

	layer_4 : <forward_convolutional_layer>
gws : 104 104 64
m : 64, k : 288
copy to device time : 0.002202 sec
execution time : 0.105905 sec
copy from gpu time : 0.008321 sec
conv ocl time : 0.116455 sec
l.workspace_size: 12460032
layer 4: Predicted in 0.116485 seconds.

	layer_5 : <forward_maxpool_layer>
l.workspace_size: 0
layer 5: Predicted in 0.017016 seconds.

	layer_6 : <forward_convolutional_layer>
gws : 52 52 128
m : 128, k : 576
copy to device time : 0.002015 sec
execution time : 0.101696 sec
copy from gpu time : 0.004710 sec
conv ocl time : 0.108444 sec
l.workspace_size: 6230016
layer 6: Predicted in 0.108471 seconds.

	layer_7 : <forward_maxpool_layer>
l.workspace_size: 0
layer 7: Predicted in 0.008108 seconds.

	layer_8 : <forward_convolutional_layer>
gws : 26 26 256
m : 256, k : 1152
copy to device time : 0.002568 sec
execution time : 0.087079 sec
copy from gpu time : 0.002404 sec
conv ocl time : 0.092071 sec
l.workspace_size: 3115008
layer 8: Predicted in 0.092124 seconds.

	layer_9 : <forward_maxpool_layer>
l.workspace_size: 0
layer 9: Predicted in 0.001629 seconds.

	layer_10 : <forward_convolutional_layer>
gws : 13 13 512
m : 512, k : 2304
copy to device time : 0.004663 sec
execution time : 0.079605 sec
copy from gpu time : 0.001357 sec
conv ocl time : 0.085641 sec
l.workspace_size: 1557504
layer 10: Predicted in 0.085665 seconds.

	layer_11 : <forward_maxpool_layer>
l.workspace_size: 0
layer 11: Predicted in 0.003181 seconds.

	layer_12 : <forward_convolutional_layer>
gws : 13 13 512
m : 1024, k : 4608
copy to device time : 0.016406 sec
execution time : 0.318138 sec
copy from gpu time : 0.002458 sec
conv ocl time : 0.337024 sec
l.workspace_size: 3115008
layer 12: Predicted in 0.337055 seconds.

	layer_13 : <forward_convolutional_layer>
gws : 13 13 512
m : 512, k : 9216
copy to device time : 0.016612 sec
execution time : 0.314551 sec
copy from gpu time : 0.001218 sec
conv ocl time : 0.332397 sec
l.workspace_size: 6230016
layer 13: Predicted in 0.332420 seconds.

	layer_14 : <forward_convolutional_layer>
l.n: 425, l.c: 512, l.groups: 1, l.size: 1, l.w: 13, l.h: 13
m:425, k:512, n:169,Total:36774400
no normalization...
batchnorm time : 0.000205 sec
activate time : 0.000498 sec
l.workspace_size: 346112
layer 14: Predicted in 0.033912 seconds.

	layer_15 : <forward_region_layer>
l.workspace_size: 0
layer 15: Predicted in 0.004318 seconds.

GPU time 1.282211 seconds.

data/person.jpg: Predicted in 1.448609 seconds.
dog: 92%
person: 91%
horse: 92%
root@h3ulcb:~/darknet_pearl# 